DETAIL = {
  "Cambridge ACS": {
    "项目介绍": {
      "项目时长": "9个月",
      "授课语言": "英语",
      "学位类型": "Mphil",
      "是否强制实习": "否",
      "毕业是否需要论文": "是",
      "奖学金": "剑桥提供少量奖学金，较难获得",
      "其他信息": "无"
    },
    "项目优劣势": {
      "Pros": [
        "优异的QS排名和国内名声",
        "剑桥是一个安全美丽的城市，剑桥大学也有着独特的历史文化",
        "有少部分机会可以成为剑桥Phd"
      ],
      "Cons": [
        "学制短，不到一年的时间可能无法满足部分城市留学生户口政策"
      ]
    },
    "注意事项": {
      "网申注意事项": [
        "语言未达到可以先等offer，如果录取后面再补交（据说参加剑桥英语考核可能相对容易）",
        "1000字符的SOP，差不多150个单词就能填满",
        "研究计划的写作需要关注，老师面试可能会提出相关问题"
      ],
      "其他注意事项": [
        "有面试的话，是能被录取的积极信号，可以去小红书/一亩三分地查看面经"
      ]
    }
  },
  "ETH MSCS": {
    "项目介绍": {
      "项目时长": "2~3年",
      "授课语言": "EN",
      "学位类型": "Master of Computer Science",
      "是否强制实习": "否",
      "毕业是否需要论文": "是",
      "奖学金": "ESOP奖学金（难以获得）",
      "其他信息": "无"
    },
    "项目优劣势": {
      "Pros": [
        "优异的QS排名和国际名誉，全球顶尖CS实验室",
        "变态且扎实的课业难度",
        "学费便宜（1kCHF左右）",
        "瑞士风景不错，较为安全，到其他国家游玩方便（如果你还能有时间玩）"
      ],
      "Cons": [
        "没有自带实习，瑞士实习/工作难度较高",
        "苏黎世生活成本较高",
        "期待您的贡献！理性回答即可 :)"
      ]
    },
    "注意事项": {
      "网申注意事项": [
        "该项目申请无需提交课程描述",
        "高中毕业证明的一种处理办法是拿到本地公证处进行中英文公证"
      ],
      "其他注意事项": [
        "暂无"
      ]
    }
  },
  "Cambridge MLMI": {
    "项目介绍": {
      "项目时长": "11月",
      "授课语言": "EN",
      "学位类型": "Mphil",
      "是否强制实习": "否",
      "毕业是否需要论文": "是",
      "奖学金": "剑桥提供少量奖学金，较难获得",
      "其他信息": "无"
    },
    "项目优劣势": {
      "Pros": [
        "优异的QS排名和国内名声",
        "剑桥是一个安全美丽的城市，剑桥大学也有着独特的历史文化",
        "有少部分机会可以成为剑桥Phd"
      ],
      "Cons": [
        "11个月，学制短，不到一年的时间可能无法满足部分城市留学生户口政策",
        "期待您的贡献！理性回答即可 :)"
      ]
    },
    "注意事项": {
      "网申注意事项": [
        "语言未达到可以先等offer，如果录取后面再补交（据说参加剑桥英语考核可能相对容易）",
        "1000字符的SOP，差不多150个单词就能填满"
      ],
      "其他注意事项": [
        "暂无"
      ]
    }
  },
  "EPFL MSCS": {
    "项目介绍": {
      "项目时长": "2~3年",
      "授课语言": "EN",
      "学位类型": "MSc in Computer Science",
      "是否强制实习": "是",
      "毕业是否需要论文": "是",
      "奖学金": "IC research scholarship & EPFL excellence fellowship (在申请时勾选，且均难以获得)",
      "其他信息": "无"
    },
    "项目优劣势": {
      "Pros": [
        "优异的QS排名和国际名誉，全球顶尖CS实验室",
        "自带瑞士实习，提升留瑞工作几率",
        "变态且扎实的课业难度",
        "学费便宜",
        "日内瓦湖风景不错，较为安全，到其他国家游玩方便（如果你还能有时间玩）"
      ],
      "Cons": [
        "洛桑相对高昂的生活成本（但相对苏黎世会好一些）",
        "期待您的贡献！理性回答即可 :)"
      ]
    },
    "注意事项": {
      "网申注意事项": [
        "EPFL的推荐人不可更换（由于申请网站很垃圾），请一定得找100%能给你些推荐信的老师（虽然只有两份推荐信EPFL也会审理你的材料）。",
        "提交申请后才会给推荐人发送推荐信链接，且一旦提交申请，材料不可补交。因而需要仔细斟酌提交申请的时间（由于申请截止日期临近西方国家圣诞假期，需要国外推荐人的小伙伴尤其需要斟酌提交申请的时间）。",
        "EPFL会要求推荐人提交对被推荐人排名的预估，建议提前告知推荐人自己的排名。"
      ],
      "其他注意事项": [
        "待完成"
      ]
    }
  },
  "ETH Cyber Security": {
    "项目介绍": {
      "项目时长": "2~3年",
      "授课语言": "EN",
      "学位类型": "Master in Cyber Security",
      "是否强制实习": "无",
      "毕业是否需要论文": "是",
      "奖学金": "ESOP",
      "其他信息": "无"
    },
    "项目优劣势": {
      "Pros": [
        "优异的QS排名和国际名誉，全球顶尖CS实验室",
        "变态且扎实的课业难度",
        "学费便宜（1kCHF左右）",
        "瑞士风景不错，较为安全，到其他国家游玩方便（如果你还能有时间玩）"
      ],
      "Cons": [
        "期待您的贡献！理性回答即可 :)"
      ]
    },
    "注意事项": {
      "网申注意事项": [
        "高中毕业证明的一种处理办法是拿到本地公证处进行中英文公证"
      ],
      "其他注意事项": [
        "暂无"
      ]
    }
  }
}