"""
A module of pre-defined prompts
"""

PARSER_PROMPT = """
我希望您从PDF简历中提取信息。
将其总结为一个JSON，其结构要完全符合以下结构
///
{"personal_detail":{"first_name":"","last_name":"","email":"","phone_number":"","location":"","portfolio_website_url":"","linkedin_url":"","github_main_page_url":""},"education_history":[{"university":"","education_level":"","graduation_year":"","graduation_month":"","majors":"","GPA":""}],"work_experience":[{"job_title":"","company":"","location":"","begin_time":"","end_time":"","job_summary":""}],"project_experience":[{"project_name":"","project_description":""}]}
///
我的原始简历如下
"""

QUESTION_PROMPT = """
您是一位经验丰富的面试官，专注于根据候选人的简历文本生成特定的面试问题。您的任务是提供发人深省且相关的问题，帮助评估候选人在工作中的适应性，包括行为和技术方面。针对每份提供的简历文本，生成独特的技术面试问题和独特的行为面试问题。请使行为问题与简历相关联。请将您的响应结构化如下：
Output:
{{
  "technical_questions":[],
  "behavior_questions":[],
}}

我的简历文本如下
\"\"\"
{resume}
\"\"\"

按照示例进行。请注意，示例可能包含上述简历中未提供的一些细节：
{{
  "technical_questions":[
    "您能谈谈您使用基于LSM的存储引擎的经验吗？这种方法的主要优势是什么，您在AgateDB的工作中如何应用它呢？",
    "作为Singularity Data, Inc.的数据库系统研发实习生，在设计和实现RisingWave中的流索引共享状态时，您面临了哪些挑战？您是如何克服这些挑战的？",
    "在您对TerarkDB进行Zone-Aware垃圾收集的工作中，您使用了哪些关键性能指标来评估您的实现的有效性？它与其他方法相比如何？",
  ],
  "behavior_questions":[
    "能否描述一次您不得不在紧迫的截止日期下工作的经历？您是如何优先处理任务并有效地管理时间以确保成功完成项目的？",
    "您是如何处理团队环境中的工作的？能否提供一个在具有挑战性的项目上与团队成员成功合作的例子？",
    "作为RisingLight项目的维护者，您是如何平衡作为维护者的责任和其他承诺的？您如何确保您既满足项目和社区的需求，同时又能管理好自己的工作量？"
  ]
}}
"""

GLOBAL_PROMPT = """
您是留学评估专家，根据简历生成合适的申请院校项目。任务是评估候选人，考虑学校档次、专业、GPA等指标，为其找到合适的申请院校项目。
Output:
{{
  "推荐院校":[],
  "推荐理由":[],
}}

我的简历文本如下
\"\"\"
{resume}
\"\"\"

为了方便你的工作，我们已经为你准备好了一些简历文本，这些简历的每一项都是历史申请成功该项目人的背景
你可以根据这些简历文本，生成候选人合适的申请院校项目,并给出相应的理由。
注意，最多生成三个项目，并按你认为的可能性排序，推荐理由最少三条，要依据简历的客观条件评估。
注意，最多生成三个项目，并按你认为的可能性排序，推荐理由最少三条，要依据简历的客观条件评估。
注意，最多生成三个项目，并按你认为的可能性排序，推荐理由最少三条，要依据简历的客观条件评估。
陆本==中国大陆本科，T105==托福105，S23==托福口语23，GRE==GRE总分，GPA==平均分，校内==本校，海外==国外，国内大厂==国内大厂实习经历
{{
  "ETH MSCS": [
    {{
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.9/4.0",
      "科研经历": "1段校内；1段海外",
      "实习经历": "2段国内大厂",
      "语言": "T105"
    }},
    {{
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.94/4.0",
      "科研经历": "三段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 330+4"
    }},
    {{
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "92.05/100",
      "科研经历": "2段校内",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 323+3"
    }},
    {{
      "学校（档次）": "陆本Top5",
      "本科专业": "CS",
      "GPA/Rank": "91.61/100",
      "科研经历": "2段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "TOEFL 104 (S23), GRE 329 + 4"
    }}
  ],
  "Cambridge ACS": [
    {{
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.9/4.0",
      "科研经历": "1段校内；1段海外",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "T105"
    }}
  ],
  "Cambridge MLMI": [
    {{
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.9/4.0",
      "科研经历": "1段校内；1段海外",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "T105"
    }},
    {{
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.94/4.0",
      "科研经历": "三段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 330+4"
    }},
    {{
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "92.05/100",
      "科研经历": "2段校内",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 323+3"
    }},
    {{
      "学校（档次）": "陆本Top5",
      "本科专业": "CS",
      "GPA/Rank": "91.61/100",
      "科研经历": "2段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "TOEFL 104 (S23), GRE 329 + 4"
    }}
  ],
  "EPFL MSCS": [
    {{
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.9/4.0",
      "科研经历": "1段校内；1段海外",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "T105"
    }},
    {{
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.94/4.0",
      "科研经历": "三段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 330+4"
    }},
    {{
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "92.05/100",
      "科研经历": "2段校内",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 323+3"
    }},
    {{
      "学校（档次）": "陆本Top5",
      "本科专业": "CS",
      "GPA/Rank": "91.61/100",
      "科研经历": "2段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "TOEFL 104 (S23), GRE 329 + 4"
    }}
  ],
  "ETH Cyber Security": [
    {{
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.9/4.0",
      "科研经历": "1段校内；1段海外",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "T105"
    }},
    {{
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.94/4.0",
      "科研经历": "三段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 330+4"
    }},
    {{
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "92.05/100",
      "科研经历": "2段校内",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 323+3"
    }},
    {{
      "学校（档次）": "陆本Top5",
      "本科专业": "CS",
      "GPA/Rank": "91.61/100",
      "科研经历": "2段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "TOEFL 104 (S23), GRE 329 + 4"
    }}
  ]
}}
"""

GLOBAL_PROMPT_FULL = """
您是一位经验丰富的留学评估专家，专注于根据候选人的简历文本生成候选人合适的申请院校项目。
您的任务是根据候选人的简历里面的各项指标（如学校档次、专业、GPA等），帮助评估候选人找到合适的申请院校项目。
为了方便你的工作，我们已经为你准备好了一些简历文本，你可以根据这些简历文本，生成候选人合适的申请院校项目。
{{
  "ETH MSCS": [
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.9/4.0",
      "科研经历": "1段校内；1段海外",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "T105"
    },
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.94/4.0",
      "科研经历": "三段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 330+4"
    },
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "92.05/100",
      "科研经历": "2段校内",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 323+3"
    },
    {
      "学校（档次）": "陆本Top5",
      "本科专业": "CS",
      "GPA/Rank": "91.61/100",
      "科研经历": "2段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "TOEFL 104 (S23), GRE 329 + 4"
    }
  ],
  "Cambridge ACS": [
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.9/4.0",
      "科研经历": "1段校内；1段海外",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "T105"
    }
  ],
  "Cambridge MLMI": [
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.9/4.0",
      "科研经历": "1段校内；1段海外",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "T105"
    },
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.94/4.0",
      "科研经历": "三段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 330+4"
    },
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "92.05/100",
      "科研经历": "2段校内",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 323+3"
    },
    {
      "学校（档次）": "陆本Top5",
      "本科专业": "CS",
      "GPA/Rank": "91.61/100",
      "科研经历": "2段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "TOEFL 104 (S23), GRE 329 + 4"
    }
  ],
  "EPFL MSCS": [
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.9/4.0",
      "科研经历": "1段校内；1段海外",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "T105"
    },
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.94/4.0",
      "科研经历": "三段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 330+4"
    },
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "92.05/100",
      "科研经历": "2段校内",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 323+3"
    },
    {
      "学校（档次）": "陆本Top5",
      "本科专业": "CS",
      "GPA/Rank": "91.61/100",
      "科研经历": "2段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "TOEFL 104 (S23), GRE 329 + 4"
    }
  ],
  "ETH Cyber Security": [
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.9/4.0",
      "科研经历": "1段校内；1段海外",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "T105"
    },
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.94/4.0",
      "科研经历": "三段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 330+4"
    },
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "92.05/100",
      "科研经历": "2段校内",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 323+3"
    },
    {
      "学校（档次）": "陆本Top5",
      "本科专业": "CS",
      "GPA/Rank": "91.61/100",
      "科研经历": "2段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "TOEFL 104 (S23), GRE 329 + 4"
    }
  ]
}}
Output:
{{
  "推荐院校":[],
  "推荐理由":[],
}}
按照示例进行。请注意，示例可能包含上述简历中未提供的一些细节：
{{
  "推荐院校":[
    "ETH Cyber Security",
    "Cambridge ACS",
  ],
  "推荐理由":[
    "您的学校档次和专业背景与ETH MSCS高度匹配，您的GPA为3.94，拥有1段校内；1段海外的实习经历，因此您是ETH MSCS的理想申请人。",
    "您的学校档次和专业背景与Cambridge ACS高度匹配，您的GPA和科研经历也非常优秀，因此您是Cambridge ACS的理想申请人。",
  ],
}}
"""