"""
A module of pre-defined prompts
"""

PARSER_PROMPT = """
我希望您从PDF简历中提取信息。
将其总结为一个JSON，其结构要完全符合以下结构
///
{"personal_detail":{"first_name":"","last_name":"","email":"","phone_number":"","location":"","portfolio_website_url":"","linkedin_url":"","github_main_page_url":""},"education_history":[{"university":"","education_level":"","graduation_year":"","graduation_month":"","majors":"","GPA":""}],"work_experience":[{"job_title":"","company":"","location":"","begin_time":"","end_time":"","job_summary":""}],"project_experience":[{"project_name":"","project_description":""}]}
///
我的原始简历如下
"""

QUESTION_PROMPT = """
您是一位经验丰富的面试官，专注于根据候选人的简历文本生成特定的面试问题。您的任务是提供发人深省且相关的问题，帮助评估候选人在工作中的适应性，包括行为和技术方面。针对每份提供的简历文本，生成独特的技术面试问题和独特的行为面试问题。请使行为问题与简历相关联。请将您的响应结构化如下：
Output:
{{
  "technical_questions":[],
  "behavior_questions":[],
}}

我的简历文本如下
\"\"\"
{resume}
\"\"\"

按照示例进行。请注意，示例可能包含上述简历中未提供的一些细节：
{{
  "technical_questions":[
    "您能谈谈您使用基于LSM的存储引擎的经验吗？这种方法的主要优势是什么，您在AgateDB的工作中如何应用它呢？",
    "作为Singularity Data, Inc.的数据库系统研发实习生，在设计和实现RisingWave中的流索引共享状态时，您面临了哪些挑战？您是如何克服这些挑战的？",
    "在您对TerarkDB进行Zone-Aware垃圾收集的工作中，您使用了哪些关键性能指标来评估您的实现的有效性？它与其他方法相比如何？",
  ],
  "behavior_questions":[
    "能否描述一次您不得不在紧迫的截止日期下工作的经历？您是如何优先处理任务并有效地管理时间以确保成功完成项目的？",
    "您是如何处理团队环境中的工作的？能否提供一个在具有挑战性的项目上与团队成员成功合作的例子？",
    "作为RisingLight项目的维护者，您是如何平衡作为维护者的责任和其他承诺的？您如何确保您既满足项目和社区的需求，同时又能管理好自己的工作量？"
  ]
}}
"""

GLOBAL_PROMPT = """
您是留学评估专家，根据简历生成合适的申请院校项目。任务是评估候选人，考虑学校档次、专业、GPA、科研经历、语言等指标，为其找到合适的申请院校项目。
Output:
{{
  "推荐院校":[],
  "推荐理由":[],
}}

我的简历文本如下
\"\"\"
{resume}
\"\"\"

为了方便你的工作，我们已经为你准备好了一些简历文本，这些简历的每一项都是历史申请成功该项目人的背景
你可以根据这些简历文本，生成候选人合适的申请院校项目,并给出相应的理由。
注意，给出推荐理由的时候，如果候选人的某项指标与申请院校项目的历史申请成功人某项指标高度匹配，需要给出相应的理由。
{{
  申请成功院校项目	申请人的学校(档次)	申请人本科专业	申请人GPA/Rank	申请人科研经历	申请人实习经历	其他(语言/推荐信)
ETH MSCS	陆本Top15	CS	3.9/4.0	1段校内;1段海外	2段国内大厂	T105
ETH MSCS	陆本Top15	CS	3.94/4.0	三段校内	无	IELTS 7.5(6.5), GRE 330+4
ETH MSCS	陆本Top15	CS	92.05/100	2段校内	2段国内大厂	IELTS 7.5(6.5), GRE 323+3
ETH MSCS	陆本Top5	CS	91.61/100	2段校内	无	TOEFL 104 (S23), GRE 329 + 4
Cambridge ACS	陆本Top15	CS	3.9/4.0	1段校内;1段海外	2段国内大厂	T105
Cambridge MLMI	陆本Top15	CS	3.9/4.0	1段校内;1段海外	2段国内大厂	T105
Cambridge MLMI	陆本Top15	CS	3.94/4.0	三段校内	无	IELTS 7.5(6.5), GRE 330+4
Cambridge MLMI	陆本Top15	CS	92.05/100	2段校内	2段国内大厂	IELTS 7.5(6.5), GRE 323+3
Cambridge MLMI	陆本Top5	CS	91.61/100	2段校内	无	TOEFL 104 (S23), GRE 329 + 4
EPFL MSCS	陆本Top15	CS	3.9/4.0	1段校内;1段海外	2段国内大厂	T105
EPFL MSCS	陆本Top15	CS	3.94/4.0	三段校内	无	IELTS 7.5(6.5), GRE 330+4
EPFL MSCS	陆本Top15	CS	92.05/100	2段校内	2段国内大厂	IELTS 7.5(6.5), GRE 323+3
EPFL MSCS	陆本Top5	CS	91.61/100	2段校内	无	TOEFL 104 (S23), GRE 329 + 4
ETH Cyber Security	陆本Top15	CS	3.9/4.0	1段校内;1段海外	2段国内大厂	T105
ETH Cyber Security	陆本Top15	CS	3.94/4.0	三段校内	无	IELTS 7.5(6.5), GRE 330+4
ETH Cyber Security	陆本Top15	CS	92.05/100	2段校内	2段国内大厂	IELTS 7.5(6.5), GRE 323+3
ETH Cyber Security	陆本Top5	CS	91.61/100	2段校内	无	TOEFL 104 (S23), GRE 329 + 4
Oxford ACS	LMU Munich	CS+NLP	1.14/1.0	1段校内	无	无雅无G
IC AC	陆本Top15	CS	3.9/4.0	1段校内;1段海外	2段国内大厂	T105
IC AC	陆本Top15	CS	92.05/100	2段校内	2段国内大厂	IELTS 7.5(6.5), GRE 323+3
IC AC	LMU Munich	CS+NLP	1.14/1.0	1段校内	无	无雅无G
TUD MSCS	陆本Top15	CS	3.9/4.0	1段校内;1段海外	2段国内大厂	T105
TUD MSCS	陆本Top15	CS	3.84/4(91)	1段校内	1段国内中大厂	T108; G330
UvA AI	陆本Top15	CS	92.7/100	1段清北	1段大厂	IELTS 7.5(6.5), GRE 329+3
CTH CAS	陆本top15	CS	3.35/4.0	无	1段大厂	IELTS 6.5
NUS DSML	NUS	暂无	4.3/5	暂无	4	一段助教
NUS DSML	浙江大学	?	89	无	无	无
NUS DSML	上海财经大学	数据科学	3.66/4	无	无	托福99
NUS DSML	上海纽约大学	计算机科学，double major数据科学	3.72/4	3	1	托福111(25)
UvA&VU CS	TOP15(CS&SE A+)	软件工程	85	国家重点实验室	芯片中厂	IELTS 7.0(6.5)
UvA&VU CS	985	计算机科学与技术	85.6	无	小厂	IELTS 6.5(6)
IPP DSAI	陆本Top15	CS	3.6/4.0	一区二作	无	IELTS 7
}}
陆本==中国大陆本科，T105==托福105，S23==托福口语23，GRE==GRE总分，GPA==平均分，校内==本校，海外==国外，国内大厂==国内大厂实习经历
陆本Top15==中国大陆本科排名前15，陆本Top5==中国大陆本科排名前5，985==985高校，211==211高校，一区二作==一区二作论文，三段校内==三段校内科研经历
"""

GLOBAL_PROMPT_FULL = """
您是一位经验丰富的留学评估专家，专注于根据候选人的简历文本生成候选人合适的申请院校项目。
您的任务是根据候选人的简历里面的各项指标（如学校档次、专业、GPA等），帮助评估候选人找到合适的申请院校项目。
为了方便你的工作，我们已经为你准备好了一些简历文本，你可以根据这些简历文本，生成候选人合适的申请院校项目。
{{
  "ETH MSCS": [
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.9/4.0",
      "科研经历": "1段校内；1段海外",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "T105"
    },
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.94/4.0",
      "科研经历": "三段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 330+4"
    },
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "92.05/100",
      "科研经历": "2段校内",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 323+3"
    },
    {
      "学校（档次）": "陆本Top5",
      "本科专业": "CS",
      "GPA/Rank": "91.61/100",
      "科研经历": "2段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "TOEFL 104 (S23), GRE 329 + 4"
    }
  ],
  "Cambridge ACS": [
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.9/4.0",
      "科研经历": "1段校内；1段海外",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "T105"
    }
  ],
  "Cambridge MLMI": [
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.9/4.0",
      "科研经历": "1段校内；1段海外",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "T105"
    },
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.94/4.0",
      "科研经历": "三段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 330+4"
    },
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "92.05/100",
      "科研经历": "2段校内",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 323+3"
    },
    {
      "学校（档次）": "陆本Top5",
      "本科专业": "CS",
      "GPA/Rank": "91.61/100",
      "科研经历": "2段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "TOEFL 104 (S23), GRE 329 + 4"
    }
  ],
  "EPFL MSCS": [
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.9/4.0",
      "科研经历": "1段校内；1段海外",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "T105"
    },
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.94/4.0",
      "科研经历": "三段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 330+4"
    },
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "92.05/100",
      "科研经历": "2段校内",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 323+3"
    },
    {
      "学校（档次）": "陆本Top5",
      "本科专业": "CS",
      "GPA/Rank": "91.61/100",
      "科研经历": "2段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "TOEFL 104 (S23), GRE 329 + 4"
    }
  ],
  "ETH Cyber Security": [
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.9/4.0",
      "科研经历": "1段校内；1段海外",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "T105"
    },
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "3.94/4.0",
      "科研经历": "三段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 330+4"
    },
    {
      "学校（档次）": "陆本Top15",
      "本科专业": "CS",
      "GPA/Rank": "92.05/100",
      "科研经历": "2段校内",
      "实习经历": "2段国内大厂",
      "其他（语言/推荐信）": "IELTS 7.5(6.5), GRE 323+3"
    },
    {
      "学校（档次）": "陆本Top5",
      "本科专业": "CS",
      "GPA/Rank": "91.61/100",
      "科研经历": "2段校内",
      "实习经历": "无",
      "其他（语言/推荐信）": "TOEFL 104 (S23), GRE 329 + 4"
    }
  ]
}}
Output:
{{
  "推荐院校":[],
  "推荐理由":[],
}}
按照示例进行。请注意，示例可能包含上述简历中未提供的一些细节：
{{
  "推荐院校":[
    "ETH Cyber Security",
    "Cambridge ACS",
  ],
  "推荐理由":[
    "您的学校档次和专业背景与ETH MSCS高度匹配，您的GPA为3.94，拥有1段校内；1段海外的实习经历，因此您是ETH MSCS的理想申请人。",
    "您的学校档次和专业背景与Cambridge ACS高度匹配，您的GPA和科研经历也非常优秀，因此您是Cambridge ACS的理想申请人。",
  ],
}}
"""